import scipy.stats as stats

areas = [1.05, 1.06, 0.74, 0.88, 0.92, 1.17, 1.07, 1.12, 1.02, 1.02, 0.65, 1.25, 1.01, 0.69, 1.13]
avg_checks = [346.2, 378.3, 330.3, 238.8, 331.1, 431.0, 408.3, 383.5, 341.4, 352.8, 338.1, 446.9, 326.6, 274.7, 381.0]

corr, p_value = stats.pearsonr(areas, avg_checks)

print("Коэффициент корреляции Пирсона: {:.4f}".format(corr))
print("p-value: {:.4f}".format(p_value))

# проверка наличия зависимости на уровне значимости alpha
alpha = 0.05
if p_value < alpha:
    print("\033[32mМежду площадью и средним чеком есть статистически значимая зависимость.\033[39m")
else:
    print("\033[32mМежду площадью и средним чеком нет статистически значимой зависимости.\033[39m")