from scipy.stats import kendalltau

X = [19,20,22,24,28,30,31,32,34,37,39,40,41,43,45,46,47,48,50,51,53,54,55,58,60,62,65,68,70,72]
Y = [8.5,9.2,11.2,10.4,16.2,17.4,14.3,24.9,22.8,20.8,34.1,30.4,28.8,33.8,35.3,34.4,32.3,29.4,31.8,30.3,28.7,31.9,25.5,19.9,22.3,20.6,18.3,14.7,14.1,15.0]

tau, p_value = kendalltau(X, Y)

print("Статистика критерия: ", tau)
print("p-значение: ", p_value)

alpha = 0.05
if p_value < alpha:
    print("\033[32mПо критерию Кендалла отвергаем нулевую гипотезу о независимости переменных.\033[39m")
else:
    print("\033[32mПо критерию Кендалла не получилось отвергнуть нулевую гипотезу о независимости переменных.\nПеременные независимы\033[39m")