import math

C = [29, 38, 42, 44, 45, 47, 51, 53, 53, 54, 56, 56, 56, 58, 58, 59, 60, 60, 60, 60, 61, 61, 61, 61, 62, 64, 65, 65, 67, 67, 68, 69, 71, 74, 82, 85]
y=2138
y2=131682
n=36
y_mean = y/n
print(f'среднее значение: {y_mean}')
Y = y_mean * n
print(f'общее количество товара: {Y}')
std = 200
e = std/n
print(f'отклонение выборочного среднего: {e}')
a = 1 - 0.95
Ql = -1.96
Qr = 1.96

yl=y_mean+Ql*e
print(f'Левая граница Д.И. для среднего: {yl}')
yr=y_mean+Qr*e
print(f'Правая граница Д.И. для среднего: {yr}')
print(f'Д.И для средней стоимости: {yl,yr}')
y2_mean =y2/n
std=n/(n-1)*(y2_mean-y_mean**2)
print(f'оценка среднего квадратического отклонения: {std}')
n2 = 12
q=Qr*math.sqrt(std)/math.sqrt(n2)*math.sqrt(1-n2/n)
print(f'\033[31mточность для суммарного значения = {q} < 5.56 (откл. выб. среднего)\nЯ согласна с экспертом\033[39m')
